app/controllers/poll_questions_controller.rb

SELECT  "poll_questions".* FROM "poll_questions"   ORDER BY "poll_questions"."id" DESC LIMIT 1
---
  def qotd
    @poll_question = PollQuestion.last

SELECT  "poll_questions".* FROM "poll_questions"   ORDER BY "poll_questions"."id" DESC LIMIT 1
---
  def didCurrentUserVote
    @poll_question = PollQuestion.last

INSERT INTO "poll_vote_histories" ("answer_index", "created_at", "poll_answer_id", "poll_question_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer_index", 0], ["created_at", "2014-11-30 05:44:22.342546"], ["poll_answer_id", 0], ["poll_question_id", 3], ["updated_at", "2014-11-30 05:44:22.342546"]]
SELECT "poll_vote_histories".* FROM "poll_vote_histories"  WHERE "poll_vote_histories"."poll_question_id" = 3
---
  def submitVote
    anonymous = params[:anonymous]
    if signed_in? or anonymous
      qid = params[:question_id]
      aid = params[:answer_id]
      index = params[:answer_index]
      lat = params[:lat]
      lon = params[:lon]

      hist = PollVoteHistory.create(poll_question_id:qid, poll_answer_id:aid, answer_index: index, lat: lat, lon: lon)

      puts hist.to_json
      @history = PollVoteHistory.where(poll_question_id: qid)