app/controllers/poll_questions_controller.rb

  def index
    @poll_questions = PollQuestion.all
---
SELECT "poll_questions".* FROM "poll_questions"